Documents/ВыплатаЗПКоммерческогоОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ВыплатаЗПКоммерческогоОтдела</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОбеспеченоПоСтатье</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодЗадач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Кураторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Куратор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыплатаЗПКоммерческогоОтдела/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца( Объект.ПериодРегистрации);
КонецПроцедуры


//&НаСервере
//Процедура ЗаполнитьСписокЗадачНаСервере()
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	БюджетПоМесяцамОбороты.ЗадачаПроекта,
//		|	СУММА(ВЫБОР
//		|			КОГДА БюджетПоМесяцамОбороты.ТипСуммы = &ТипСуммыПлан
//		|				ТОГДА БюджетПоМесяцамОбороты.СуммаОборот
//		|			ИНАЧЕ ВЫБОР
//		|					КОГДА БюджетПоМесяцамОбороты.ТипСуммы = &ТипСуммыФакт
//		|						ТОГДА -БюджетПоМесяцамОбороты.СуммаОборот
//		|					ИНАЧЕ 0
//		|				КОНЕЦ
//		|		КОНЕЦ) КАК БазаРаспределения
//		|ИЗ
//		|	РегистрНакопления.БюджетПоМесяцам.Обороты(, , , ) КАК БюджетПоМесяцамОбороты
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА БюджетПоМесяцамОбороты.ЗадачаПроекта = ДАТАВРЕМЯ(1, 1, 1)
//		|				ТОГДА БюджетПоМесяцамОбороты.ЗадачаПроекта.Владелец.ГодПроекта
//		|			ИНАЧЕ ГОД(БюджетПоМесяцамОбороты.ЗадачаПроекта.НачалоРабот)
//		|		КОНЕЦ = &ГодЗадач
//		|	И БюджетПоМесяцамОбороты.СтатьяСметы = &СтатьяСметы
//		|	И БюджетПоМесяцамОбороты.СуммаОборот <> 0
//		|	И БюджетПоМесяцамОбороты.Месяц = &ПериодРегистрации
//		|	И БюджетПоМесяцамОбороты.ЗадачаПроекта.Владелец.Куратор В(&Кураторы)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	БюджетПоМесяцамОбороты.ЗадачаПроекта";
//	
//	Запрос.УстановитьПараметр("ГодЗадач", 			ГодЗадач);
//	
//	Кураторы = Объект.Кураторы.Выгрузить(,"Куратор").ВыгрузитьКолонку("Куратор");
//	Запрос.УстановитьПараметр("Кураторы", 			Кураторы);
//	Запрос.УстановитьПараметр("СтатьяСметы", 		Справочники.СтатьиСметы.ВознаграждениеКМ );
//	Запрос.УстановитьПараметр("ПериодРегистрации", 	Объект.ПериодРегистрации);
//	Запрос.УстановитьПараметр("ТипСуммыПлан", 		Перечисления.ТипСуммыБюджета.План);
//	Запрос.УстановитьПараметр("ТипСуммыФакт", 		Перечисления.ТипСуммыБюджета.Факт);
//	
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//	
//	Док = РеквизитФормыВЗначение("Объект");
//	Док.Распределение.Очистить();
//	Док.Распределение.Загрузить( РезультатЗапроса );
//	
//	ЗначениеВРеквизитФормы( Док, "Объект");
//КонецПроцедуры


//&НаСервере
//Процедура ЗаполнитьСписокЗадачНаСервере()
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	БюджетПоМесяцам.ЗадачаПроекта,
//		|	СУММА(ВЫБОР
//		|			КОГДА БюджетПоМесяцам.ТипСуммы = &ТипСуммыПлан
//		|				ТОГДА БюджетПоМесяцам.Сумма
//		|			ИНАЧЕ ВЫБОР
//		|					КОГДА БюджетПоМесяцам.ТипСуммы = &ТипСуммыФакт
//		|						ТОГДА -БюджетПоМесяцам.Сумма
//		|					ИНАЧЕ 0
//		|				КОНЕЦ
//		|		КОНЕЦ) КАК БазаРаспределения
//		|ИЗ
//		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА БюджетПоМесяцам.ЗадачаПроекта = ДАТАВРЕМЯ(1, 1, 1)
//		|				ТОГДА БюджетПоМесяцам.ЗадачаПроекта.Владелец.ГодПроекта
//		|			ИНАЧЕ ГОД(БюджетПоМесяцам.ЗадачаПроекта.НачалоРабот)
//		|		КОНЕЦ = &ГодЗадач
//		|	И БюджетПоМесяцам.СтатьяСметы = &СтатьяСметы
//		|	И БюджетПоМесяцам.Месяц = &ПериодРегистрации
//		|	И БюджетПоМесяцам.ЗадачаПроекта.Владелец.Куратор В(&Кураторы)
//		|	И БюджетПоМесяцам.Регистратор <> &Ссылка
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	БюджетПоМесяцам.ЗадачаПроекта";
//	
//	Запрос.УстановитьПараметр("ГодЗадач", 			Объект.ГодЗадач);
//	
//	Кураторы = Объект.Кураторы.Выгрузить(,"Куратор").ВыгрузитьКолонку("Куратор");
//	Запрос.УстановитьПараметр("Кураторы", 			Кураторы);
//	Запрос.УстановитьПараметр("СтатьяСметы", 		Справочники.СтатьиСметы.ВознаграждениеКМ );
//	Запрос.УстановитьПараметр("ПериодРегистрации", 	Объект.ПериодРегистрации);
//	Запрос.УстановитьПараметр("ТипСуммыПлан", 		Перечисления.ТипСуммыБюджета.План);
//	Запрос.УстановитьПараметр("ТипСуммыФакт", 		Перечисления.ТипСуммыБюджета.Факт);
//	Запрос.УстановитьПараметр("Ссылка",				Объект.Ссылка );
//	
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//	
//	Док = РеквизитФормыВЗначение("Объект");
//	Док.Распределение.Очистить();
//	Док.Распределение.Загрузить( РезультатЗапроса );
//	
//	ЗначениеВРеквизитФормы( Док, "Объект");
//КонецПроцедуры


// 2017 08 09
// поменяли базу распределения с плана на факт
&НаСервере
Процедура ЗаполнитьСписокЗадачНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетПоМесяцам.ЗадачаПроекта,
		|	СУММА(БюджетПоМесяцам.Сумма) КАК БазаРаспределения
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
		|ГДЕ
		|	ВЫБОР
		|			КОГДА БюджетПоМесяцам.ЗадачаПроекта = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА БюджетПоМесяцам.ЗадачаПроекта.Владелец.ГодПроекта
		|			ИНАЧЕ ГОД(БюджетПоМесяцам.ЗадачаПроекта.НачалоРабот)
		|		КОНЕЦ = &ГодЗадач
		|	И БюджетПоМесяцам.СтатьяСметы = &СтатьяСметы
		|	И БюджетПоМесяцам.Месяц = &ПериодРегистрации
		|	И БюджетПоМесяцам.ЗадачаПроекта.Владелец.Куратор В(&Кураторы)
		|	И БюджетПоМесяцам.Регистратор <> &Ссылка
		|	И БюджетПоМесяцам.ТипСуммы = &ТипСуммыФакт
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцам.ЗадачаПроекта";
	
	Запрос.УстановитьПараметр("ГодЗадач", 			Объект.ГодЗадач);
	
	Кураторы = Объект.Кураторы.Выгрузить(,"Куратор").ВыгрузитьКолонку("Куратор");
	Запрос.УстановитьПараметр("Кураторы", 			Кураторы);
	Запрос.УстановитьПараметр("СтатьяСметы", 		Справочники.СтатьиСметы.ВознаграждениеКМ );
	Запрос.УстановитьПараметр("ПериодРегистрации", 	Объект.ПериодРегистрации);
	//Запрос.УстановитьПараметр("ТипСуммыПлан", 		Перечисления.ТипСуммыБюджета.План);
	Запрос.УстановитьПараметр("ТипСуммыФакт", 		Перечисления.ТипСуммыБюджета.Факт);
	Запрос.УстановитьПараметр("Ссылка",				Объект.Ссылка );
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Док = РеквизитФормыВЗначение("Объект");
	Док.Распределение.Очистить();
	Док.Распределение.Загрузить( РезультатЗапроса );
	
	ЗначениеВРеквизитФормы( Док, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСписокЗадач(Команда)
	ЗаполнитьСписокЗадачНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоЗадачамНаСервере()
	МассивКоэфф 	= Объект.Распределение.Выгрузить(,"БазаРаспределения").ВыгрузитьКолонку("БазаРаспределения");
	мНачисления		= РаспределитьПропорционально( Объект.СуммаДокумента, 	МассивКоэфф);
	Для Каждого СтрР ИЗ Объект.Распределение Цикл
		Индекс	= Объект.Распределение.Индекс(СтрР);
		СтрР.Сумма = мНачисления[Индекс];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоЗадачам(Команда)
	Если Объект.СуммаДокумента = 0 Тогда
		ПоказатьПредупреждение(,"Не указана сумма распределения!",10);
		Возврат;
	КонецЕсли;
	Если Объект.Распределение.Итог("БазаРаспределения") = 0 Тогда
		ПоказатьПредупреждение(,"Не заполнены задачи проекта!",10);
		Возврат;
	КонецЕсли;
		
	
	РаспределитьПоЗадачамНаСервере();
КонецПроцедуры
